In [ ]:
#import pandas
import pandas as pd

In [5]:
#creating series
s=pd.Series([20,40,60,80,100],index=['a','b','c','d','e'])
print("Series data:")
print(s)
print("Access single element:",s['d'])

Series data:
a     20
b     40
c     60
d     80
e    100
dtype: int64
Access single element: 80

In [ ]:
type(s) # to check the type of s

pandas.core.series.Series

In [20]:
#creating dataframe
df=pd.DataFrame({
    'Employee':['Gauri','Payal','Shreyas','Urvi','Parth'],
    'Age':[21,22,23,21,22],
    'Salary':[50000,60000,55000,52000,58000],
    'Location':['Kopargaon','Mumbai','Kopargaon','Pohegaon','Shirdi']
})
print("Dataframe data:")
print(df)
print("\nAccess single column:\n",df['Employee'])

Dataframe data:
  Employee  Age  Salary   Location
0    Gauri   21   50000  Kopargaon
1    Payal   22   60000     Mumbai
2  Shreyas   23   55000  Kopargaon
3     Urvi   21   52000   Pohegaon
4    Parth   22   58000     Shirdi

Access single column:
 0      Gauri
1      Payal
2    Shreyas
3       Urvi
4      Parth
Name: Employee, dtype: object

In [21]:
type(df) # to check the type of df

pandas.core.frame.DataFrame

In [29]:
#load dataset
df=pd.read_csv('restaurant_sales.csv',header=0)
print(df.info()) # to get info about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 254 entries, 0 to 253
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order ID        254 non-null    int64
 1   Date            254 non-null    object
 2   Product         254 non-null    object
 3   Price           254 non-null    float64
 4   Quantity        254 non-null    float64
 5   Purchase Type   254 non-null    object
 6   Payment Method  254 non-null    object
 7   Manager         254 non-null    object
 8   City            254 non-null    object
dtypes: float64(2), int64(1), object(6)
memory usage: 18.0+ KB
None

In [30]:
print(df.head()) # to print first 5 rows of dataframe

   Order ID        Date             Product  Price  Quantity Purchase Type  \
0     10452  07-11-2022               Fries   3.49    573.07       Online
1     10453  07-11-2022           Beverages   2.95    745.76       Online
2     10454  07-11-2022       Sides & Other   4.99    200.40     In-store
3     10455  08-11-2022             Burgers  12.99    569.67     In-store
4     10456  08-11-2022  Chicken Sandwiches   9.95    201.01     In-store

  Payment Method             Manager    City
0      Gift Card    Tom      Jackson  London
1      Gift Card         Pablo Perez  Madrid
2      Gift Card       Joao    Silva  Lisbon
3    Credit Card       Walter Muller  Berlin
4    Credit Card       Walter Muller  Berlin

In [31]:
print(df.tail()) # to print last 5 rows of dataframe

     Order ID        Date             Product  Price  Quantity Purchase Type  \
249     10709  28-12-2022       Sides & Other   4.99    200.40   Drive-thru
250     10710  29-12-2022             Burgers  12.99    754.43   Drive-thru
251     10711  29-12-2022  Chicken Sandwiches   9.95    281.41   Drive-thru
252     10712  29-12-2022               Fries   3.49    630.37   Drive-thru
253     10713  29-12-2022           Beverages   2.95    677.97   Drive-thru

    Payment Method        Manager    City
249      Gift Card  Walter Muller  Berlin
250      Gift Card  Walter Muller  Berlin
251      Gift Card  Walter Muller  Berlin
252      Gift Card  Walter Muller  Berlin
253      Gift Card  Walter Muller  Berlin

In [32]:
df.describe() # to get statistical summary of dataframe

           Order ID       Price    Quantity
count    254.000000  254.000000  254.000000
mean   10584.133858    7.102323  460.611457
std       75.889181    4.341855  214.888699
min    10452.000000    2.950000  200.400000
25%    10520.250000    3.490000  201.010000
50%    10583.500000    4.990000  538.880000
75%    10649.750000    9.950000  677.440000
max    10713.000000   29.050000  754.430000

In [33]:
# to save dataframe to a new csv file
df.to_csv('new_restaurant_sales.csv',index=False)